{
    "Plants": [
        {
            "plant name": "Plant name: Alpinia Galanga\\n",
            "common name": "Common name: Siamese Ginger, Galangal, Greater Galangal, Thai Ginger.\\n",
            "family": "Family: Zingiberaceae.\\n",
            "description": "Description: Alpinia Galanga is an herbaceous plant. It can grow up to 3.5 centimeters with thick underground rhizomes. The rhizomes have a red and brown color on the surface. The inside of the rhizome is brown and orange in color. The plant is erect and covered with leaves. The leaves are smooth and acute. The size and shape of the leaves are 3.8 to 11.5 centimeters. Flowers have a pleasant smell and have white buds. The flowers are greenish-white in color with a dark-red veined tip. The flowers also produce red berries. The fruit is oval in shape and is colored orange to red. The fruits have a diameter of 1.5 centimeters.\\n",
            "uses": "Uses: The leaves are best suited in cooking. In boiling, sauteing and steaming. To impart flavor to soups, stews, curries and chutneys. The flavors of the leaf compliments meats, fish and shellfish. It pairs well with citrus, garlic and tamarind.",
            "health benifits": "Health Benifits: It opens blocked sweat pores in the body. It neutralized the harmful effects in the gut. It stimulates digestion and also helps to treat sore mouths. It helps in the process of purification of blood. Used to treat stomach pain, back pain, asthma, diabetes and kidney disease. It is also used to increase appetite.\\n",
            "ayurveda info": "Ayurveda Info: According to Bhavprakash Nighantu, alpinia galanga is used to pacify kapha dosha in the body. It is heavy in nature, bitter in taste and hot in potency. It helps to cure inflammation, pain, gout, cough and poisoning. This herb is used to treat 80 types of vata disorders.\\n",
            "origin and location": "Origin and Location: It is believed to have originated in Southeast Asia, specifically in Southern China. Today, it is cultivated in India, Arabia, Thailand, Indonesia and Sri Lanka. It is found in specialty markets in Europe, Asia and the United States. It favours hot places exposed to extensive sunlight. It can also grow in shrubs, forests, and open spaces. In India, Galangal plants are exported to the Western Ghats and Himalayan Regions.\\n"
        },
        {
            "plant name": "Amaranthus Viridis",
            "common name": " Slender Amaranth, Green Amaranth, Pig Weed, Jungali Chaulayi.",
            "family": "Amaranthaceae.",
            "description": "In Greek, Amaranthus means immortal. It is an annual herb with an upright and light green stem. It grows to about 60 to 80 centimeters in height. The leaves are 15 centimeters long. It is mid to light green in color and deeply veined. The leaves have a long stalk and a pointed tip. Flowers are small and green. Fruits are small and wrinkled. It is brown and contains smooth and shiny seeds.",
            "uses": "Amaranth leaves have been used in the diet by the people of Maldives. It is eaten as a boiled green in many parts of the world. The leaves are offered to those who are ill or fasting. The leaves can be eaten raw or cooked as it is easy on the digestive system. The Negros of the Philippines apply the bruised leaves directly to skin. To treat eczema, psoriasis and rashes with good results. The plant is also a good cattle fodder and green manure. The ash is rich in soda and is used to make soap.",
            "health benifits": "It contains up to 38% protein by dry weight. The leaves and seeds contain lysine. It is needed for production and absorption of calcium. It promotes hair growth and good skin. It lowers the bad cholesterol responsible for many cardiac problems. It also contains anti-cancer properties. The root juice of this plant is used to treat inflammation during urination. It is used in the treatment of fever, pain, asthma and diabetes. It is also used to treat liver and eye disorders.",
            "ayurveda info": "It is included under the group of vegetables (shaka varga).  Its vipaka is pungent. The liquid  prepared is used in the treatment of diabetes.",
            "origin and location": "It is native to the southern United States and Mexico. It is possibly of Asian origin or from the South Americas. It is occasionally cultivated in Africa."
        },
        {
            "plant name": "Artocarpus Heterophyllus",
            "common name": "Jackfruit, Jack Tree.",
            "family": "Moraceae.",
            "description": "The jack tree bears the largest fruit of all trees. It reaches as much as 55 kilograms in weight. It is 90 centimeters in length and 20 inches in diameter. A mature jack tree produces around 200 fruits per year. The older trees bear up to 500 fruits in a year. It can reach up to heights of 10 to 20 meters. The multiple fruit consists of hundreds to thousands of individual flowers. The bark of the jackfruit tree is reddish to brown in color. It is smooth in texture. The leaves are alternate and spirally arranged. In younger trees, the edges of the leaves are irregularly folded. In older trees it is rounded and dark green in color. The fruit consists of 100 to 500 seeds. It has a distinctive sweet and fruity aroma scent. The fruits mature during the rainy season from July to August.",
            "uses": "The seeds of this fruit are roasted and used. The cuisines of many Asian countries use cooked young jackfruit. The boiled young jackfruit is used in salads and vegetables. It is also used in spice curries and side dishes. It is also used as fillings for cutlets and chops. It can be cooked with coconut milk and eaten alone or with meat. In Southern India, unripe jackfruit slices are deep-fried to make chips.",
            "health benifits": "It contains Vitamin C, A, potassium, calcium, sodium and zinc. It lowers blood pressure and prevents cancer cells. It is helpful for the digestive health and people with constipation. The seeds are the great source of dietary fiber which assists weight loss. Since it is a great source of calcium it helps to treat the condition of osteoporosis. It also fights obesity. It is good for urinary retention and cures various skin diseases.",
            "ayurveda info": "It suggests jackfruit as a natural remedy for many illnesses. Unripe jackfruit is very nutritious as it lessens the Vata Dosha",
            "origin and location": "Its origin is in the rain forests of the Western Ghats of India. It spread to other parts of India and the Philippines. It is seen in Africa and is popular in Brazil and Suriname. It is one of the most edible food items in all these places. It is said that it even helped people survive during famine times in the past."
        },
        {
            "plant name": "Azadirachta Indica",
            "common name": " Neem, Nimtree, Margosa Tree.",
            "family": "Meliaceae.",
            "description": "Neem is a fast-growing tree and is valued as a medicinal plant. It can grow up to 15 to 30 meters in height. It has attractive rounded crowns and thick wrinkled bark. The vibrant green leaves are smooth and glossy with sharp zig-zag edges. The leaves are medium to large in size and its shape is elongated to oblong. The tree grows white and fragrant flowers. It has yellow olive-like fruit that has a bittersweet pulp. The bark, leaves, and seeds are used to make medicine. Less frequently, the root, flower, and fruit are also used. The neem tree matures into a large shade tree and can live for 150-200 years. Traditionally, the neem tree has health-promoting as well as everyday uses.",
            "uses": "The leaves are used in both raw and cooked applications as frying or boiling. The taste of the Neem leaves is so bitter that they are used sparingly in culinary applications. It is used in tomato and fish pastes, or even pickled for extended use. In Bengal, young neem leaves are cooked with eggplant in an appetizer called nim begun. In Myanmar, the leaves are used in salads.It pairs with turmeric, red chili, peanuts, tamarind and rice. The oil from the seeds goes into soaps, waxes and lubricants. The gum from bark is extracted for tannins and dental-care products. The leaves are sometimes used for emergency livestock feed. The flowers are a prized source of honey. The seed oil is used as a pesticide.",
            "health benifits": "It contains chemicals that help to reduce blood sugar levels. It heals ulcers in the digestive tract.It kills bacteria and prevents heart disease. It also helps ageing skin and any kind of skin irritation or itching. It is used to treat urine infection, disorders as well as stomach worms. It has antifungal properties. It helps to get rid of dandruff and treat head lice.",
            "ayurveda info": "It is bitter in taste. It gives a powerful cooling energy (virya). The cooling capacity supports healthy blood. It balanced pitta particularly when there is heat in rakta dhatu (the blood). Its light and dry qualities give it the ability to counter kapha as well. Its cold, light, and dry qualities tend to aggravate vata. It has a balancing effect on pitta and kapha in prana vaha srotas.",
            "origin and location": "Neem is thought to have originated in Assam and Burma. However, the exact origin is uncertain. It is in India that the tree is most widely used. It is grown from the southern tip of Kerala to the northern himalayan hills. The tree has been established in Fiji, Mauritius, and many countries of Central and South America."
        },
        {
            "plant name": "Basella Alba",
            "common name": "Indian Spinach, Malabar Spinach.",
            "family": "Basellaceae.",
            "description": "Basella Alba is a popular green leafy vegetable. It has a soft-stemmed, twining red or green vine. It can grow up to 10 feet long. The leaves are thick, fleshy, pointed at the tip and arranged alternately along the vine. Flowers are white, pink, or red in short spikes and are located in the leaf axils. The fruits are round and soft, and can be red, white, or black in color. The seeds are round and black. It grows flowers from May to September. The seeds ripen from July to October. It cannot grow in the shade and it prefers moist soil.",
            "uses": "Leaves and stem tips can be eaten raw or cooked. The leaves can be used as spinach or added to salads. Do not overcook the leaves or they will become slimy. It is an excellent thickening agent in soups, stews and other dishes. It is used in the form of dal, chutney, soup, curry and various other forms. In Sri Lanka, it is used to make different kinds of curries. The vegetable is used in Chinese cuisine. It has many names including flowing water vegetable",
            "health benifits": "It improves testosterone levels in males, thus boosting libido. Decoction of the leaves is recommended as a safe laxative in pregnant women and children. Externally, the sticky leaf is crushed and applied in urticaria, burns and scalds. It has gastro-protective activity, ulcer healing, and anti-inflammatory activity. It also helps to heal wounds, hypertension and is attributed to improve breast milk production. Roots can be used medicinally to treat diarrhea.",
            "ayurveda info": "It increases kapha dosha. It balances vata and pitta dosha.",
            "origin and location": "It is found in tropical Asia and Africa where it is widely used as a leaf vegetable. It is native to the Indian subcontinent, Southeast Asia and New Guinea. It is naturalized in China, Africa, Brazil, Colombia, Philippines, West Indies."
        },
        {
            "plant name": "Brassica Juncea",
            "common name": "Chinese Mustard, Brown Mustard, Indian Mustard, Leaf Mustard.",
            "family": "Mustards or Brassicaceae.",
            "description": "Brassica Juncea is a herbaceous plant. It can grow up to 1 meter or taller. It has long and erect branches. Its seeds germinate within 5 days. The lower leaves are deeply lobed. The upper leaves are narrow and entire. The flowers are pale yellow in color. The fruit is dry and splits open when ripe. It prefers well-drained, fertile soil high in organic matter. The leaves, if eaten, have a somewhat peppery taste.",
            "uses": "The leaves, seeds, and stems of this mustard variety are edible. In Russia, this is the main species grown for the production of mustard oil. It is widely used in canning, baking and margarine production in Russia. The majority of Russian table mustard is also made from Brassica Juncea. The leaves are used in the Punjabi Cuisine called sarson da saag. The thick stem of this plant is used to make Nepali pickle or achar. Chinese and Japanese cuisines also make use of mustard greens. In Japanese cuisine, it is known as takana and often used as a pickle. In Tanzania, the roots have been given to cows to promote milk production. It is one of the major edible oils in India, Bangladesh, Pakistan. In these places, it is appreciated for its special taste and pungency. In Africa and Asia the leaves are eaten as a vegetable, cooked and served as a side dish.",
            "health benifits": "It reduces symptoms of arthritis. It prevents urinary stones. It fights off colds and flu. It is helpful during pregnancy. It fights cancer, prevents acne, protects eye health and improves mental health. It is rich in antioxidants and it maintains bone health.",
            "ayurveda info": "It is bitter and sharp in taste, hot in potency and relieves vata dosha. It aggravates pitta dosha and causes burning sensation, treats gulma, skin diseases and wounds. It also balances kapha dosha.",
            "origin and location": "The center of origin is in Western and Central Asia. Brown mustard has been cultivated in Asia and Europe for thousands of years. Presently, vegetable types of Brassica juncea are cultivated throughout southern and eastern Asia."
        },
        {
            "plant name": "Carissa Carandas",
            "common name": "Bengal Currant, Christ's Thorn, Karonda,Karanda.",
            "family": "Apocynaceae.",
            "description": "Carissa Carandas is a rank-growing, messy, woody, climbing shrub. It can grow about 1.5 to 2 meters in height. Leaves are 1 to 3 inches long, very dark green and shiny. If the leaves or stems are injured, the white milky sap is seen. The flowers are small, fragrant and white in color. The fruits are small and purplish to black in color. Fruits usually occur in clusters somewhat resembling large purple grapes. The plant is grown from seed sown in August and September. It is a hardy, drought-tolerant plant that thrives well in a wide range of soils.",
            "uses": "In the Indian subcontinent, it is used to make chutneys, pickles. It is also used as a berry substitute in tarts and pies. It is best suited for cooked applications when combined with sweeteners. The berries may have a very tart, almost sour flavor. Fruit exudes latex when being cooked. In India, it is taken with green chilies to make a tasty dish and chapatis.",
            "health benifits": "The entire plant has medicinal value. It is used to cure various diseases such as asthma, skin disease, cough and cold. It effectively reduces fever and heals diseases related to the heart. It stops internal bleeding and removes impurities from blood. Fresh fruit juice of karanda is used to improve appetite and digestion. The leaf paste is applied over fresh wounds. The thorny branches are used as a fencing material. The wood is used to make household furniture. The wood is smooth and useful for fashioning spoons, combs and household utensils.",
            "ayurveda info": "The unripe fruit may cause an increase of kapha and pitta dosha",
            "origin and location": "The origin is said to be in India, Burma, Malacca and Ceylon. It is commonly cultivated in these areas and its fruits are marketed in villages. The karanda was first fruited in the Philippines in 1915. It was described as one of the best small fruits introduced into the Philippines within recent years."
        },
        {
            "plant name": "Citrus Limon",
            "common name": "Lemon.",
            "family": " Rutaceae.",
            "description": "It is the leading acid citrus fruit. It has a very appealing color, odor and flavor. The tree reaches 10 to 20 feet in height. The leaves are reddish when young and become dark green to light green. Mildly fragrant flowers may be solitary, or there may be two or more. The flowers have 4 or 5 petals, white on the upper surface, purplish beneath. Fruit is oval and light-yellow in color. It is aromatic, and dotted with oil glands. Lemon trees can grow for 150 years.",
            "uses": "It is used in small quantities to add flavor to food. It gives flavor to baked goods, sauces, salad dressings, marinades, drinks and desserts. It contains citric acid that breaks down stains. It is used to clean plastic, wooden cutting boards and wooden utensils. The leaves are used to make tea, meat and seafood. Lemon oil is extracted from oil-containing cells in the skin.",
            "health benifits": "It has vitamin C. Citric acid may help prevent kidney stones by increasing urine volume. It contains iron and prevents anemia. It improves gut health and slows the digestion of sugars.It aids weight loss and reduces the risk of heart disease.",
            "ayurveda info": "It works on an aggravated kapha due to its Ushan (hot) potency. It also boosts the immune system if taken regularly.",
            "origin and location": "They are thought to have originated in north-western India. It is known that lemons were introduced to southern Italy around 200AD. It has been cultivated in Egypt and Iran since 700AD. Arabs spread lemons throughout the Mediterranean area during the early second century."
        },
        {
            "plant name": "Ficus Auriculata",
            "common name": "Elephant Ear Fig, Tirmal, Roxburgh fig.",
            "family": "Moraceae.",
            "description": "Ficus auriculata is a type of fig tree noted for its big and round leaves. It is a small tree and grows to 5 to 10 meters high. The leaves are big and round. They are 44 centimeters long and 45 centimeters wide. It has a rounded base and acute apex. It produces both male and female flowers produced by separate individuals. It is a wide spreading evergreen tree found in moist, lowland tropics. Its fruit is edible and often harvested from the wild. The fruits form as large clusters. It is not uncommon to discover a tree where the base is covered with hundreds of fruits. It is least resistant to fire, but likes good sunlight.",
            "uses": "The fruits can be eaten raw or cooked. It is used in jams, juice and curries. It is also used in various industrial products as nourishing foods. The leaves of this tree are used as fodder in Nepal",
            "health benifits": "Stem bark juice is effective for diarrhea, cuts and wounds. Roasted figs are taken for diarrhea and dysentery. Root latex is used in mumps, cholera, diarrhea and vomiting. It has anti-inflammatory, antioxidant, and antibacterial properties. It has diuretic, laxative and digestive regulating properties.",
            "ayurveda info": "It balances doshas and it increases kapha and helps balance pitta.",
            "origin and location": "It is native to India, Nepal, Sikkim, Thailand and South China."
        },
        {
            "plant name": "Ficus Religiosa",
            "common name": "Bodhi Tree, Peepal.",
            "family": "Moraceae.",
            "description": "Peepal is an evergreen tree. It can grow 15 to 30 meters tall. The leaves are heart-shaped. The tree bears small fig-like fruits. Its fruit is purple in color. It is one of the longest living trees. The tree can withstand extreme weather temperatures. It has a lifespan ranging between 900 to 1500 years. It releases more oxygen during early hours in the morning. It is a tree that has been worshipped since the dawn of civilization. People tie threads of white, red and yellow silk around it. To pray for offering and rewarding parenthood. The Hindus in India regard it as the tree beneath which Vishnu was born. Hence, it holds a great spiritual value in Indian traditions.",
            "uses": "The leaves help in relieving symptoms of jaundice. Its leaves are used to feed the camels and the elephants. When the leaves are dried they are used for the decoration purpose.",
            "health benifits": "It cures eye pain. It prevents tooth diseases. It is good for the liver and it purifies blood by removing the impurities. Its leaves contain glucose while its bark contain Vitamin K. The powdered fruit is taken for asthma. Its seeds have proved useful in urinary troubles. The leaves are used to treat constipation.",
            "ayurveda info": "The plant is hard to digest. It is cold, heavy and rough in quality and sticky in taste. It alleviates pitta, vata and kapha doshas.",
            "origin and location": "Peepal trees are grown throughout India. It is mainly grown in the State of Haryana, Bihar, Kerala and Madhya Pradesh. It is also found in the Ranthambore National Park in India."
        },
        {
            "plant name": "Hibiscus Rosa-sinensis",
            "common name": "Chinese hibiscus, China Rose, Shoeblackplant.",
            "family": "Malvaceae.",
            "description": "Hibiscus rosa-sinensis is an ornamental plant. It is cultivated throughout the tropics and subtropics. The leaves are often lobed and may be smooth or covered in plant hairs. The flowers can be borne singly or in clusters. The flowers of many species last only a single day.It is grown for its large somewhat bell-shaped blossoms. Cultivated varieties have red, white, yellow, or orange flowers.",
            "uses": "It provides food, medicines, and a dye. It is one of the most commonly grown hedges in the tropics. The plant can be used in the human diet, as a cure for various disorders. Wild types of hibiscus are an important source of food for larvae of certain insects. It is also used as a laxative. People use the hibiscus flowers to make chutneys, soups and curries.",
            "health benifits": "It can lower cholesterol levels. It is quite beneficial for weight loss. It increases blood flow and displays and helps treat depression. Due to the cooling effects of it, fever can also be reduced. The pulp or juice made from these leaves can treat skin wounds. In Africa, the parts of the plant were used in the treatment of liver disease, cold and constipation. Hibiscus flowers have been used as a medicine in menopause treatment.",
            "ayurveda info": "It is very effective in pacifying aggravated pitta and kapha doshas. ",
            "origin and location": "The exact origin of Hibiscus rosa-sinensis is unknown. It has been cultivated in China, Japan and the Pacific Islands for a long time. Many believe it comes from India."
        },
        {
            "plant name": "Jasminum",
            "common name": "Jasmine.",
            "family": "Oleaceae.",
            "description": "The jasmine has been cultivated for thousands of years. For its tiny, star-shaped flowers and intoxicating fragrance. The species grow as climbers on other plants or on structures. The leaves can be either evergreen or deciduous. The leaf shape is simple, trifoliate, or pinnate, with up to nine leaflets. The Jasmine stems are slender, trailing, green, angled, and almost 4 sided. The flowers are generally white, although some species have yellow flowers. Flowering is in spring or summer in most of its species.",
            "uses": "It is a sweet smelling plant. It is known for its ornamental beauty and distinctive fragrance. It is also used frequently in making tea, syrup and essential oils. In food it is used to flavor beverages, candy and in puddings. In manufacturing, it is used to add fragrance to creams, lotions, and perfumes.",
            "health benifits": "It relieves abdominal pain and liver scarring. It is also used to prevent stroke, to cause relaxation and in cancer treatment. It is used on skin to reduce the amount of breast milk and to heal wounds. It is inhaled to improve mood, reduce stress and reduce food cravings.",
            "ayurveda info": "It says that the nervous system is controlled by Vata. Imbalance of Vata causes weak memory or poor mental alertness. It has vata balancing and medhya (brain tonic) properties. It helps manage mental alertness.",
            "origin and location": "Most jasmine plants are found in tropical to subtropical climates. Their center of diversity is in South Asia and Southeast Asia. Several jasmine species have become naturalized in Mediterranean Europe."
        },
        {
            "plant name": "Mangifera Indica",
            "common name": "Mango, Aam.",
            "family": " Anacardiaceae.",
            "description": "Mangos has been an important crop in India for millennia. It is a member of the cashew family. It is one of the most important fruits of the tropical world. The tree is evergreen, often reaching 15 to 18 meters in height. It has a thick trunk and a wide canopy. The leaves are leathery and sharp. The flowers are small, pinkish, and fragrant. The fruit varies greatly in size and character. Its form is oval, round, heart-shaped or long and slender. Some varieties are vividly colored with shades of red, yellow and dull green. The single large seed is flattened. The flesh of the seed is yellow to orange in color. It is juicy and has a distinctive sweet-spicy flavour.",
            "uses": "The raw fruits are used in products. Like chutney, pickle, etc. Ripe ones are used in making pulp, juice, nectar, squash, leather, slices, etc.",
            "health benifits": "Mangos can help stabilize the digestive system. It is a great source of magnesium and potassium. It reduces the inflammation of the heart and it contains antioxidants. Oil prepared from mango seed is applied over the scalp. To treat hair loss and excessive hair fall. It contains Vitamin C and A.",
            "ayurveda info": "The kernel of the seed of mango mitigates pitta and kapha. Unripe mango fruit is not suitable for health. Ripe mango fruit mitigates vata and pitta. Flowers act as a coolant, and are especially beneficial in urinary disorders. Seed oil balances kapha and vata.",
            "origin and location": "It originated in India over 4,000 years ago and is considered a sacred fruit. Mangoes spread gradually throughout Asia and then to the rest of the world. Most of the mango seeds are dispersed by animals, birds, and humans. The flesh of mango fruits are eaten by the animals and birds. They drop the edible part on the ground."
        },
        {
            "plant name": "Mentha",
            "common name": "Mint, Bush Mint, Spearmint.",
            "family": "Lamiaceae.",
            "description": "Mints are aromatic, almost exclusively perennial herbs. The leaves are arranged in opposite pairs. Leaf color ranges from dark green, purple blue and pale yellow. The fruit is a nutlet, containing one to four seeds. The small flowers are purple, pink and white in color.",
            "uses": "It is used in tobacco and food industries and particularly in cosmetology. The leaves, flowers, stem, bark and seeds have medicinal value. The oil is used to flavor a variety of foods such as gum or candy. The aromatic oil is used as a flavouring and sometimes as a scent.",
            "health benifits": "It is rich in antioxidants, menthol and phytonutrients. It possesses strong antibacterial and antiseptic effects. Regularly taking pudina can ease chest congestion. The menthol present helps loosen mucus collected and makes breathing easier. Pudina or mint has a strong, refreshing smell. It can ease stress and refresh the body and mind.",
            "ayurveda info": "It benefits the kapha and vata dosha.",
            "origin and location": "It dates back to Greek mythology. It originated in the Mediterranean later in Britain, America and the rest of the world."
        },
        {
            "plant name": "Moringa Oleifera",
            "common name": "Drumstick.",
            "family": "Moringaceae.",
            "description": "It is a small to medium evergreen or deciduous tree. It can grow to a height of 10 to 12 meters. It has a crown, typically umbrella-shaped. The roots are deep. The bark is corky and grey. The branches are fragile and drooping, with a feathery foliage. Moringa leaves are alternate. The flowers are 7 to 14 millimeter long. The fruit is referred to as a “pod” and is 10 to 60 centimeters in length. It looks like a drumstick, hence the name “drumstick tree”. The fruit is green when young and turns brown at maturity. The mature fruit splits open along each angle to expose the seeds. The capsule contains 15 to 20 rounded oily seeds. Moringa seeds contain a large amount of oil.",
            "uses": "The oil contains cosmetic value. Its oil is used in the perfume industry, as it readily retains fragrance. Products are made from the leaf powder, soaps, face wash, tea, capsules and tablets.",
            "health benifits": "All the parts of this plant contain rich minerals and vitamins. The leaves have 7 times more vitamin C. 15 times more potassium than bananas. It also has calcium, protein, iron, and amino acids. It helps heal the body and build muscle. It is packed with antioxidants. It can protect cells from damage and may boost the immune system.",
            "ayurveda info": "It decreases imbalanced kapha and vata. It increases pitta and vitiated blood. It should not be taken during bleeding disorders and menstruation. People who have pitta related skin diseases shouldn’t consume this plant.",
            "origin and location": "During the Middle Ages, it used to provide rhythm to musical performances. Drumsticks made their first noted appearance in the 7th century in Asia. It now grows in the wild or is cultivated in America, Asia and various countries of Oceania."
        },
        {
            "plant name": "Muntingia Calabura",
            "common name": "Jamaica cherry, Kewni, Paanchara, Gasagase hanninamara.",
            "family": "Muntingiaceae.",
            "description": "It is a fast growing tree and has branches that are spreading horizontally. It reaches 20 to 40 feet in height. The leaves are evergreen, alternate and long pointed at apex. Flowers resemble strawberry bloom. The fruits are round and red or yellow in color. The fruits have a smooth, thick and tender skin. It contains hundreds of tiny seeds. The seeds are very fine and yellowish in color. The tree is drought-resistant but not salt-resistant. The seeds are spread by birds and they germinate only with light.",
            "uses": "It is often cooked in tarts and made into jam. The leaf infusion is drunk as a tea-like beverage.",
            "health benifits": "The flowers are said to possess antiseptic properties. The mixture of flowers taken relieves headache and the symptoms of cold. The flowers are also used as an antiseptic and to treat abdominal pain. The fruits possess antioxidant properties. The leaves have laxative and antiseptic properties. It has anti-inflammatory and anti-diabetic properties. ",
            "ayurveda info": "Various parts of the plant are used to treat different types of illnesses. The flowers and bark are used to reduce swelling. The leaves when boiled are used to reduce gastric ulcer and to alleviate headache and cold. The plant is also used to treat stomach ache and mouth pimples.",
            "origin and location": "It is indigenous to Mexico, Central and South America. It is widely cultivated in India, Indonesia and the Philippines. The fruits are sold in Mexican markets."
        },
        {
            "plant name": "Murraya Koenigii",
            "common name": "Curry Leaf, Kari Patta.",
            "family": "Rutaceae.",
            "description": "Curry Leaf Tree is a small tree, growing 4 to 6 meters tall. The leaves are pinnate with 11 to 21 leaflets. Each leaflet is 2 to 4 centimeters long and 1 to 2 centimeters broad. The flowers are small, white and fragrant. The berries are small, shiny and black in color. The seeds of the berries are poisonous.",
            "uses": "When cooking, the leaves are generally used fresh off of the tree. The leaves are used both in Indian cuisine and traditional medicines. It is usually fried along with the vegetable oil, mustard seeds and chopped onions. The fresh leaves are valued as seasoning in the cuisines of South and Southeast Asia. In Cambodia, the leaves are roasted and used as an ingredient in a soup called maju krueng. In Java, the leaves are often stewed to flavor gulai. The oil is extracted and is used to make scented soaps. The oil is used for aromatherapy.",
            "health benifits": "The curry leaf oil is used as a sun protection. It is used as a cream or lotion to cure skin problems like acne or ringworm. It is rich in Vitamin A and Calcium which helps keep the bone healthy and strong. The leaf extract is used to reduce the white patches all over the body. It also has antioxidative, anti-diarrhoea, anti-cancer activity",
            "ayurveda info": "The curry leaves are appreciated for its therapeutic actions like keshya, pachana, ruchya, etc.",
            "origin and location": "The tree is native to the Indian subcontinent. Commercial plantations have been established in India, and more recently Australia. It grows best in well-drained soils in areas with full sun or partial shade. Growth is more robust when temperatures are at least 18 degree celsius."
        },
        {
            "plant name": "Nerium Oleander",
            "common name": "Oleander, Kaner.",
            "family": "Apocynaceae.",
            "description": "Karavira is a large evergreen shrub with white latex. The plant consists of various types based on the color such as red, yellow, white, etc. The leaves are thick and long. The red colored flowers have dark green leaves. The white colored flowers have light green leaves. Fruits are cylindrical and are about 4 to 6 inch in length. The fruits have many seeds. The fruit of the yellow variety has seeds that are poisonous. The root system is highly branched and is gray in color. Bark is soft and is of silvery grey white color.",
            "uses": "This herb is a cardiac toxic and it should not be used without the advice of a doctor. It is not safe for children so keep this herb out of sight and reach of children. It is also not safe in case of pregnant and lactating mothers and even for external application. If taken accidentally it may result in severe poisonous symptoms. It is a good fungicide, insecticide, larvicide, parasiticide and rodenticide.",
            "health benifits": "It works as a low-level toxicant to boost immune function in individuals. Today, scientists are looking into the possible health benefits of heavily diluted oleander. It could possibly treat skin conditions such as eczema and can help heal muscle cramps. It could naturally support conditions like asthma, epilepsy and paralysis.",
            "ayurveda info": "It is a herbal plant which is toxic but has been found to have ayurvedic uses. Its external application is indicated in bites of poisonous insects. The stem, leaves and flowers of Karavira contain glycosides which show anti-inflammatory activity. It balances kapha and vata.",
            "origin and location": "In the ancient texts, it is known as “the desert rose”. In the 15th century the Mesopotamians trusted in the healing benefits of oleander extracts. It is native to the Western Himalayas. It is an incredibly hardy, adaptable plant which grows thick and green in mountainous climates. It is grown as an ornamental shrub in gardens throughout India. It is found growing from Nepal westwards to Kashmir and in Madhya Pradesh. It is also found in Uttar Pradesh, Punjab, Balochistan, South India, China and Japan. It is found on the road sides and grown in the fences in Southern India. Its flowers are used to worship God."
        },
        {
            "plant name": "Nyctanthes Arbor-tristis",
            "common name": "Night Blooming Jasmine, Tree of Sadness, Coral Jasmine.",
            "family": "Oleaceae.",
            "description": "It is a mythological plant and has high medicinal values in ayurveda. It can grow up to 10 meters in height. The bark is dark grey or brown in color and is rough and firm in texture. The leaves are opposite and ovate in shape. Flowers are small, fragrant, slender and hairy. The flowers with six petals are easily visible but five, seven, eight and nine petals are rare. Fruits are heart-shaped, flat and brown in color. Fruits have two sections each containing a single seed. It grows well in clayey soil. The outer layer is large, transparent and heavily vascularized.",
            "uses": "Bitter leaves extract is given to children for the expulsion of roundworms and threadworms.The fresh leaves are also used for the preparation of homoeopathic medicines. The plant is used in juices, powder, and decoction for treating various disease conditions. To treat cough or cold, two spoonfuls of the juice of leaves is taken orally along with honey. The seeds are crushed in water. The paste is applied on the hair scalp to aid against hair fall. Dried fruits are taken orally to treat coughs.",
            "health benifits": "Every part of this plant is used for medicinal purposes due to health promoting properties.The leaves are used to treat fever and fungal skin infection. The flowers are used medicinally to provoke menstruation. The bark of this tree is used in eye diseases and to stop gum bleeding.The seeds have antiviral, antifungal properties.",
            "ayurveda info": "It is used to pacify the diseases occuring due vitiation of vata and kapha. The intake of milk, ghee, sugar are used as anupana(vehicle).",
            "origin and location": "According to mythology, this plant is a heavenly tree brought to earth by Lord Krishna. It is native to the sub-tropical Himalayas of Nepal and India. It is usually found in southern parts of India, Thailand, Malaysia and Indonesia. It is found in dry hillsides and in dry deciduous forest. It is often planted near Hindu temples in India, Sri Lanka and Malaysia."
        },
        {
            "plant name": "Ocimum Tenuiflorum",
            "common name": "Holy Basil, Tulsi.",
            "family": "Lamiaceae.",
            "description": "Holy Basil is an erect, many-branched subshrub plant. It can grow up to 30 to 60 centimeters tall with hairy stems. The leaves are ovate in shape and are green or purple in color. The leaves are also strongly scented and are 5 centimeters long in length. The flowers are purplish and are placed in whorls on elongated racemes. It is described as the “most sacred herb in India’.",
            "uses": "It is used in medicine, culinary applications and as an essential oil. The leaves are used as a condiment in salads. It is used as a substitute for tea and medicine. It is used as a culinary spice in Thailand, Indonesia and other South-East Asian countries. In Hinduism, the woody stems are used to make prayer beads for rosaries. The plant is often cultivated around Hindu temples and places of worship. It is therefore regarded as a sacred plant. The leaf extract is effectively used as a mosquito repellent.",
            "health benifits": "Tulsi is recommended as a treatment for a range of conditions. It helps calm anxiety, relieves cough and asthma. It treats back pain, eye and skin diseases, snake and scorpion bites and malaria. It also treats indigestion, hiccups, vomiting, gastric and cardiac related problems.",
            "ayurveda info": "Tulsi is perhaps one of the best examples of Ayurveda's holistic lifestyle approach to health. It tastes hot and bitter. It normalizes kapha and vata dosha. It prevents diseases and promotes good health. It reduces the stresses of daily life. It is credited with giving luster to the complexion and sweetness to the voice. It helps calm emotional disposition.",
            "origin and location": "It is considered indigenous to the Indian subcontinent. It is now widely cultivated and naturalized in places around the world. The Caribbean, Pacific Islands, and parts of Africa. It has been used for various other purposes for at least 3000 years."
        },
        {
            "plant name": "Piper Betle",
            "common name": "Betel, Paan.",
            "family": "Piperaceae.",
            "description": "Piper Betle is a perennial, dioecious climber. The plant grows creeping on earth or climbing up on the trees. The leaves are simple, alternate, stipulate and are 5 to 20 centimeters long. The leaves are broad, thick, and ovate or heart in shape. The leaves are also aromatic and the taste varies from sweet to pungent. The stems are semi-woody and green or pinkish green in color.Flowering is rare. Because, the plants are replanted every four or five years under cultivation. Fruit is seen very rarely and often sunken in fleshy spikes. There are 10 to 20 seeds in each fruit, but they are poor in germination",
            "uses": "The juice of betel leaf with honey is used as eye drops. It is used as paan to relieve bad breath, toothache, tastelessness, cough and sore throat. The leaves applied with castor oil are warmed and tied over the chest. The leaves are consumed in Asia as quid or in paan with tobacco or areca nut.",
            "health benifits": "It contains anti-inflammatory properties with potent antioxidant activity. It is a treasure of bioactive phenolics. It fights cancers of oral, mammary, prostate, skin, and gastric origin. It has analgesic properties as well.",
            "ayurveda info": "It increases pitta dosha. Balances kapha and vata dosha. It relieves diseases related to kapha dosha like cough, high cholesterol level and diabetes.",
            "origin and location": "The betel plant originated in Southern and Southeast Asia. It is cultivated mostly in South and Southeast Asia, from Pakistan to Papua New Guinea. It needs a compatible tree or a long pole for support. Betel requires well-drained fertile soil. Waterlogged, saline and alkali soils are unsuitable for its cultivation."
        },
        {
            "plant name": "Plectranthus Amboinicus",
            "common name": "Indian Mint, Mexican Mint, Country Borage, Ajwain.",
            "family": "Lamiaceae.",
            "description": "It is a herbaceous plant. It can grow up to 1 meter in height. The stem of this plant is fleshy, soft and smooth. The leaves are broad and oval shaped. The aroma of the leaves can be described as a pungent combination. The taste of the leaves is described as being similar to the one of oregano. The flowers are on a short stem and are pale purplish in color",
            "uses": "It is widely cultivated as a medicinal plant, ornamental and condiment. The aromatic leaves are used as a food additive. In spice, flavouring meat, soups, fish, and local beer. The leaves are eaten as a vegetable. Due to the fragrance of the leaves, it is used in laundry and while washing the hair. In India, the juice of the leaves are used to treat skin allergies. In Brazil, it is used medicinally for the treatment of skin based infections.",
            "health benifits": "The leaves have many traditional medicinal uses. It is used for the treatment of coughs, sore throats and nasal congestion. It is also used during infections, rheumatism and flatulence. In Indonesia, it is used to stimulate lactation during childbirth.",
            "ayurveda info": "The juice is given with ginger to improve appetite and treat indigestion. The paste of the leaf is applied over the forehead to treat headache. It is also used in vatavyadhi.",
            "origin and location": "The origin is unknown, but it may be native to Africa and possibly India. It is cultivated in gardens and commercial agricultural settings. In Africa it is found at low altitudes in woodland or coastal bush. It is widely cultivated and naturalized in Indonesia. In Bolivia, the species is cultivated in semi-deciduous forest."
        },
        {
            "plant name": "Pongamia Pinnata",
            "common name": "Indian Beech.",
            "family": "Fabaceae.",
            "description": "It is a deciduous tree with a large canopy that spreads equally wide. It can grow to about 15-25 meters in height. The leaves are a soft, shiny burgundy in early summer. It matures to a glossy, deep green as the season progresses. Flowers blossom throughout the year. It then matures into brown seed pods. The tree is well suited to intense heat and sunlight. The dense shade it provides slows the evaporation of surface water. Its root structures promote nitrogen fixation. It moves nutrients from the air into the soil. It grows on sandy and rocky soils. It can withstand temperatures slightly below 0 degree celsius to 50 degree celsius.",
            "uses": "It has been used for oil production due to biodiesel use. It is used to power water pumps. It then generates electricity in rural areas with limited access to electricity. The leaves have great value as fodder, particularly for cattle and goats. The leaf shedding produces large amounts of organic litter for consumption by animals. The tree oil is used as a fuel lamp, as a raw material for soaps, varnishes and paints. It is also used to repel insects in storage areas. The wood can be used for fuel, often as charcoal. The resulting ashes are used as a dyeing agent",
            "health benifits": "It has been applied as a crude drug. It treats tumors, piles, skin diseases and ulcers. The root is effective in treating teeth, ulcers and vaginal diseases. Dried flower powder is taken orally to reduce blood sugar. The fresh bark extract is used orally to cure bleeding piles.",
            "ayurveda info": "It is used in skin diseases. Karanja twigs were used as a toothbrush in ancient times. It's bitter in rasa. It balances kapha and vata.",
            "origin and location": "It probably originated from India. It now occurs naturally from Pakistan, India, Sri Lanka, Fiji and Japan. It has been introduced in Egypt and the United States (Florida, Hawaii). It is native to eastern and tropical Asia, Australia, and Pacific islands."
        },
        {
            "plant name": "Psidium Guajava",
            "common name": " Guava, Yellow Guava, Lemon Guava.",
            "family": "Myrtaceae.",
            "description": "Guava is a fast growing evergreen shrub. It is a small tree that can grow to a height of 3-10 meters. It has a shallow root system. The trunk is slender and is covered with a smooth green to red brown bark. The leaves grow in pairs, opposite to each other. The leaf blade is elliptic and oblong in shape. The flowers are white in color and 3 centimeters in diameter. The fruit is a fleshy, pyriform or ovoid berry. The skin color is yellowish to orange. The flesh can be white, yellow, pink or red, sour to sweet, juicy and aromatic. The fruit contains a variable number of seeds. Guava flowers are fragrant, and a good source of nectar for bees",
            "uses": "It is a plant full of medicinal values. Many parts of this plant possess medicinal properties. Fruits, seeds, and leaves are the edible parts of this plant. Many delicacies are produced from the fruit and can be eaten raw too. Leaves are also used in cooking and seeds are used for oil extraction. Guava can be consumed fresh or processed. It is commonly used in the food industry to produce pulp, nectars, jams, jellies, and syrups. The seeds account for 30% of the weight of the processed fresh fruit.",
            "health benifits": "It can be regularly used for managing diabetes, cholesterol and constipation. It can help manage minor ailments like headache, cough, cold and body ache due to fatigue. Fresh paste of guava leaves can be applied on the painful joints to relieve swelling and pain. Boiling the leaves can help in treating oral problems such as toothache. It has antioxidant properties and is the best source of Vitamin C. It has Vitamin E which keeps the skin healthy and supple. Due to which, it prevents early signs of aging. It is a great metabolism booster and it is effective in healthy weight loss.",
            "ayurveda info": "It is considered as an important herbal medicine for dysentery and diarrhea. Guava helps to reduce accumulated mucus because of its Kapaha reducing property. It corrects the digestive fire and reduces Ama. It improves metabolism and helps to control high cholesterol levels",
            "origin and location": "It is believed to have originated from Southern Mexico or Central America. The Spaniards and Portuguese are considered to be responsible for distribution of guava fruit. India, South America, the United States, and the Philippines are primary producers."
        },
        {
            "plant name": "Punica Granatum",
            "common name": "Pomegranate.",
            "family": "Punicaceae.",
            "description": "Pomegranate is a deciduous tree and it is grown for its edible fruits. The tree is branched and spiny. The leaves of this tree are oval to oblong in shape. It produces bright red flowers at the tips of the branches. The fruits are rounded with a thick pink-red skin. The fruit is thick and leathery which protects the pulp and seeds inside. The inside of the fruit is separated into compartments by white spongy tissue. Each pomegranate fruit may contain as many as 600 seeds. The trees can reach a height of 10 meter and can be very long lived.",
            "uses": "Pomegranate juice, in the form of powder, may be used in yogurt production. From a spiritual perspective, the seeds of this fruit are a symbol of fertility. Five things Lord Ganesha loves and pomegranate is one of them. In Jewish Tradition it resembles fruitfulness, knowledge, learning and wisdom.",
            "health benifits": "Pomegranate contains nutrients like protein, carbohydrate, fat and magnesium. It is also a good source of vitamin C and D, sugars, iron and calcium. These properties render the fruit its therapeutic benefits. Pomegranate juice naturally reduces dental plaque. The fruit is beneficial in treating piles, diarrhea, dysentery, constipation and stomach worms.",
            "ayurveda info": "It is semi hot in potency and it has an effect to balance the Tridosha. Its rasa is sweet, astringent and sour.",
            "origin and location": "The pomegranate was originally described throughout the Mediterranean region. It was introduced into Spanish America in the late 16th century. In India, it is cultivated commercially only in Maharashtra. Small scale plantations are also seen in Gujarat, Rajasthan, Karnataka and Punjab."
        },
        {
            "plant name": "Santalum Album",
            "common name": "Sandalwood.",
            "family": "Santalaceae.",
            "description": "Santalum album is a small evergreen tree. It grows to a height of 4 meters in Australia. In India, it is much larger and can grow up to 20 meters. The bark is light, dark brown and reddish in color. The bark is smooth in young trees and has cracks in older trees. The leaves are thin, ovate in shape and shining green in color. Flowers purplish-brown, small, straw colored, reddish, green or violet. The fruits are single seeded, smooth and red to purple-black in color.",
            "uses": "In food and beverages, sandalwood is used as a flavoring. In manufacturing, sandalwood oil is used as a fragrance in soaps, cosmetics, and perfumes. The oil from the wood and the wood are used as medicine. The oil has been used as antiseptic and for treating headaches and stomach ache. In India, the oil or paste is used in the treatment of inflammatory and eruptive skin diseases. It is also used for smoothing the skin. The leaves and bark were used by early Hawaiians to treat lice, dandruff and sexually transmitted disease.",
            "health benifits": "It is used for treating the common cold, bronchitis, fever and sore mouth. It is also used to treat liver diseases, heatstroke, and heart related conditions. Don’t use white sandalwood if you have kidney problems.",
            "ayurveda info": "Its powder and oil form is known to have relaxing and cooling properties. It can balance all doshas. It is antiseptic, retains moisture levels, is toning, purifying, and soothing. One of its most important applications in Ayurveda is to treat the nervous system by calming anxiety. The oil heals the three doshas of the body - treats Vata, pacifies and balances Pitta and Kapha",
            "origin and location": "These are found in Asia, Australia, Indonesia, Hawaii, and other Pacific Islands. It is a threatened species indigenous to South India. It grows in the Western Ghats and a few other mountain ranges."
        },
        {
            "plant name": "Syzygium Cumin",
            "common name": "Jamun, Java Plum, Malabar Plum.",
            "family": "Myrtaceae.",
            "description": "Jamun is a slow growing tree. It can grow up to 30 meters in height and can live up to 100 years or more. Wood of this tree is water resistant. The leaves are like turpentine and have a soothing aroma. The young leaves are pinkish and turn leathery, glossy and dark green in color. The leaves contain rich nutritional value. It offers dense shade and is used as foliage for animals. The flowers of this tree are very tiny, white in color and aromatic. The fruits are ovoid shaped and have large berries. The unripe fruit is green and changes to pink and finally to dark crimson after ripening. The outer layer of the fruit appears dark black to purple. It has a distinct sweet taste with sour and astringent undertones.",
            "uses": "The seed can be consumed in the form of powder or churna. The fruit can be eaten raw or in the form of juices. It is used in culinary applications such as salads, smoothies and jam. The fruits can be used in puddings, mousse, break and cakes. Jamun pairs well with yogurt, coconut milk, honey, vanilla, cinnamon and mint. It also pairs with fruits like grapes, mangoes and strawberries.",
            "health benifits": "Its berry is used to treat various conditions. It is used to treat heart, asthma, stomach pain, and flatulence. It flushes toxins out of the kidneys. The high fibre content aids in digestion and prevents nausea and vomiting. The extracts from the seeds, leaves and bark are used to reduce high levels of blood sugar. Jamun contains Vitamin A,C, iron, fibre, protein, magnesium and other essential nutrients. It is a must-have fruit for women and girls during menstruation to balance the blood loss. It helps the body to recover from weakness and fatigue. The dried and powdered leaves have antibacterial properties. It is used as a tooth powder for teeth and gums.",
            "ayurveda info": "It relieves tiredness. It balances pitta and its symptoms like burning sensation. It increases Vata.",
            "origin and location": "It is originally from India. It is widely distributed in Asian countries such as Malaysia, Thailand, and the Philippines."
        },
        {
            "plant name": "Syzygium Jambos",
            "common name": "Rose Apple, Water Apple.",
            "family": "Myrtaceae.",
            "description": "It is an evergreen tree that can grow up to 10 meters tall. The leaves are lance shaped, pointed and are 10 to 20 centimeters long. The leaves are red when growing and glossy green when it has fully grown. The fruits are rose scented, whitish-green in color and it is shaped like a small pear. The flesh of the fruit is a bit softer than that of an apple. It tastes like a cross between an apple and a watermelon. In ancient Sanskrit, India was referred as jambudvipa, which means rose apple land.",
            "uses": "The dry and crisp fresh fruit is used to make jams and jellies. When cooked with custards or puddings, they impart a rose-like flavour. The large, hollow seed cavity is sometimes utilized to stuff the fruits and bake them. It is sometimes stewed with sugar and served as dessert.",
            "health benifits": "Several parts of the tree are used medicinally as a tonic or a diuretic. A sweetened preparation of the flowers is believed to reduce fever. Powdered leaves have been rubbed on the bodies of smallpox patients for the cooling effect. Cuban people believe that the root is an effective remedy for epilepsy.",
            "ayurveda info": "The seeds are used to treat diarrhoea, dysentery, diabetes and catarrh. A decoction of bark is used to relieve asthma and bronchitis.",
            "origin and location": "It is thought to be native to South-East Asia, Indonesia, Philippines and Malaysia. Its natural distribution is not in India where the tree is thought to have been introduced. It is suggested that it was also introduced to the former Indochina region."
        },
        {
            "plant name": "Tabernaemontana Divaricata",
            "common name": "Pinwheel Flower, Crape Jasmine, Chandni.",
            "family": "Apocynaceae.",
            "description": "Crape Jasmine is a shrub plant that is very common in India. It generally grows to a height of 6 feet. Its stems exude a milky latex when broken. The leaves are large, shiny and deep green in color. It blooms in spring but the flowers appear sporadically all year. Flowers are commonly used in poojas in North and South India. It can grow in full sun or partial shade.",
            "uses": "The wood of this plant is used as an incense and in perfumery. The wood is also used to make charcoal. The pulp around the seeds is used as a red dye. The plant responds well to trimming and makes an attractive flowering hedge.",
            "health benifits": "It contains medicinal benefits such as an anti-epileptic, brain tonic and antioxidant. The roots are used in modern medicine to treat hypertension, headache, and scabies. The pounded roots are applied to sore eyes. The latex of the leaves is used as a cooling application for wounds to prevent inflammation.",
            "ayurveda info": "It is widely used as a medicinal herb in the tropics. The roots, leaves, and flowers are all used in the treatment of snake and scorpion poisoning. The flowers, mixed with oil, are applied to sore eyes.",
            "origin and location": "It is native to Asian countries like India, Nepal, Bhutan, China and Thailand. It is cultivated throughout the tropics for its ornamental and fragrant flowers"
        },
        {
            "plant name": "Trigonella Foenum-graecum",
            "common name": "Fenugreek, Methi.",
            "family": "Fabaceae.",
            "description": "Fenugreek plant is an erect, smooth and herbaceous plant. It can grow up to 10 to 50 centimeters in height. The leaves are trifoliate, alternate, compound and green in color. Its stems are erect, up to 50 centimeters in height and it is sometimes branched. Flowers are 1.2 to 1.8 centimeters long. Fruit is broad, smooth and long. Its flowers blossom between January to April.",
            "uses": "It is used as a herb, spice and vegetable. In India, both whole and powdered form is used for pickles, dal, spices and sambar powder. They are roasted to reduce inherent bitterness and to enhance flavour.",
            "health benifits": "It is used to treat arthritis, male impotency, skin ailments, sore throat, bronchitis and diabetes. It is used as a nutritive supplement during pregnancy months. The seeds paste relieves pain and inflammation in wounds, abscess, boil and swellings. The leaves are used both internally and externally for their cooling properties. A gargle made from the seeds of methi is best for sore throat.",
            "ayurveda info": "It is useful in treating disorders of vata dosha imbalance. It balances kapha.",
            "origin and location": "It is probably indigenous to the eastern Mediterranean, Western Asia and India. The first written record dates back as far as 4000 BC. Its cultivation spread to China, Ethiopia, Europe, Soviet Russia and throughout the Arab World. In Europe and North America it is now grown on a small scale only."
        }
    ]
}
